{"Title": "How Were Months of Julian Calendar Named?", "Article": "1) January.<br>The month of January is named after Janus, a Roman God. Janus was believed to have 2 faces, the one which he used to see the future and the other one to see the past.<br>Indeed, a fascinating god. He was also referred to by the God of Doors.<br>2) February.<br>Named after Roman God Februalia, the month of February holds a very special significance. The moth is believed to be the month of purification.<br>In this month’s sacrifices were made to atone for sins.<br>3) March.<br>It is a month named after Mars, the Roman god of war. This month was the very first in the Roman calendar but January and February were added later.<br>Being the very first month originated, March is of special significance.<br>4) April.<br>The month’s name is derived from a Latin word called “Aperire”. The meaning of the word is “to open”. It depicts the beautiful flowers opening and spreading happiness in the month of spring.<br>5) May.<br>May is named after Greek goddess Maia. Maia is believed to be the goddess for growing of plants. May is a beautiful month marked by a beautiful name.<br>6) June.<br>June is a month in which so many weddings happens and unsurprisingly it is named after the Roman goddess Juno– the goddess of marriage and birth.<br>She also is the wife of Jupiter, who is also called as king of gods.<br>7) July.<br>Named after one of the most influencing figures of ancient roman world named Julius Caesar, the month of July had a different name earlier.<br>Earlier it was called Quintilis which is Latin for Fifth.<br>8) August.<br>Another month named after one of the figures from ancient Roman world, August gets its name from Augustus Caesar in 8 B.C.<br>Just like July it earlier had a different name. Sextilia meaning six in Latin.<br>9) September.<br>September is derived from septem, which is the Latin for number seven.<br>10) October.<br>Just like September, October initially being the eighth month derives its name from Octo which is eight in Latin.<br>11) November.<br>Following the trends of the previous two months, November was also named before the addition of January and February and thus was considered the 9th month of the year and was named from the word novem which in Latin means Nine.<br>12) December.<br>The name of this month also is from a Latin word, decem, which means ten in English."}