{"Title": "Is It Okay If My Laptop Is Always Plugged in So That My Battery Is Charged 100%? Must I Allow It to Drain Periodically by Unplugging to Increase Battery Life?", "Article": "<b>1. Myth: Leaving your devices plugged will \"overcharge\" them. </b><br>This simply isn't true. Most smartphones, laptops are smart enough to momentarily stop charging once the device is fully charged.<br>It does this long enough for the device to drain two or three percent, then it will climb back up to 100 percent.<br>Leaving it plugged in like this every single night can have an impact on the lifespan of the battery, but the act of leaving it plugged in isn't as damaging as some people make it out to be.<br>Most manufacturers suggest you calibrate your battery by discharging and recharging it once every one to three months.<br>Since your battery’s overall life diminishes over time, the time you have left on each full charge decreases a little with every full discharge.<br>Every discharge shortens the battery life just a bit. Discharging to 0% once a month helps the operating system calibrate the full life cycle of the battery so it knows exactly how much it has diminished over time.<br><br><b>2. Myth: You should always let the battery drain completely. </b><br>Today, most batteries never truly fully discharge. If you allow your battery-powered devices to go to \"dead\" each and every day, it will reduce the battery’s effectiveness over time.<br>Smartphones today have lithium-ion batteries, which don’t suffer from the memory problems of older nickel-cadmium batteries. Similarly, lithium-ion batteries count charges differently than older batteries, so you don’t need to worry about discharging it completely.<br><br><b>3. Myth: Using your laptop while charging it will diminish your battery’s capacity. </b><br>Keeping your laptop plugged in isn’t actually a problem; Once your battery is full, the power management features in your laptop will stop charging it, and draw any power the laptop needs from the charger alone.<br><br><b>What will damage your battery though, is heat.</b><br><br>Your laptop’s electronic guts can get quite hot, especially during prolonged high-workload usage.<br>Continuous exposure to that heat can diminish your battery’s ability to hold a charge.<br>Batteries will die and degrade over time no matter what you do, so don’t obsess over it too much."}