{"Title": "How Everyone Gets Water in Saudi Arabia?", "Article": "Saudi Arabia is located in desert and doesn’t have a permanent water resource such as lake, river or waterfall.<br> However, it’s creditable on the part of the nation that it still meets the demand of water completely despite the fact that there is no increase in their water resources and the demand is constantly increasing.<br> Kingdom is exploring new methods and techniques in order to fulfill the increasing demand of water. All the matters related to water are handled by the Ministry of Water and Power.<br> The most primary source of water in Saudi Arabia is aquifers where water can be stored underground.<br> The government started working on aquifers in 1970 and since then lakhs of aquifers have been constructed which provide water for both urban as well agricultural purposes.<br> The second important source of water in Saudi Arabia is sea and the process by which sea water is purified for drinking purposes is called desalination. Saudi Arabia is the biggest source of desalinated water.<br> Saline water conversion corporation (SWCC) operates 27 desalination stations and it releases 3 million cubic meters of potable water, everyday. These plants provide 70 percent of water for urban consumption apart from providing water for industrial purposes. These are main sources of electric power generation too. <br>At the moment, the process of removing salt from water is very costly as it costs nearly $1000 per acre foot while the simple process of purification costs around $200 per acre foot. The scientists are working on methods to reduce the cost of desalination and also to improvise the process.<br> 16 billion cubic feet water is being stored in more than 200 dams; some big dams are located in Wadi Jizan, Wadi Fatima, Wadi Basha and Najran.<br> This water is supplied to every corner of the country through well spread canals and it is also used for agricultural purposes.<br> Recycling of water is also done on a very big scale in the country and the government tries that 40% of used water is again provided for household chores in urban areas after recycling.<br> For this purpose, recycling plants are constructed in Riyadh, Jeddah and other important industrial centers."}