{"Title": "Why Samoa Jumped Time?", "Article": "Samoa performed a time travel as it jumped forward a day by crossing westward over the international dateline.<br>In a move designed to simplify relations with key trading partners Australia and New Zealand, time in the South Pacific nation will leap forward to December 31 - New Year's Eve - at the stroke of midnight.<br>For Samoa's 186,000 citizens, Friday 30 December 2011 will simply not exist, meaning 775 people born on December 30 will see their birthday cancelled.<br>Employers will still have to pay workers for the day which did not happen, though hotel guests will not be charged for an extra night.<br>The time jump comes 119 years after some US traders persuaded local Samoan authorities to align their islands' time with nearby US-controlled American Samoa and the US to assist their trading with California.<br>But the time zone has proved problematic in recent years because it puts Samoa nearly a full day behind key trading partners Australia and New Zealand.<br>Samoa, currently 11 hours behind GMT, 21 hours behind Eastern Australia and a further two hours behind New Zealand, will be one hour ahead of Wellington and three hours ahead of Sydney after the switch.<br>New Zealand territory Tokelau is joining Samoa in the dateline switch, but American Samoa will remain the other side of the line.<br>For more than a century Samoa has been one of the last places to see the sun go down each day. The dateline switch means it will become one of the first to see the sun rise on New Year's Day, and every day.<br>The final hour of Thursday 29 December will see carols, prayers and a speech from Prime Minister Tuilaepa Sailele Malielegaoi as the nation prepares to jump straight to New Year's Eve. Special dateline stamps have been released to mark the occasion.<br>Explaining how the decision will help his country Prime Minister Malielegaoi said: \"In doing business with New Zealand and Australia, we're losing out on two working days a week.<br>\"While it's Friday here, it's Saturday in New Zealand and when we're at church Sunday, they're already conducting business in Sydney and Brisbane.\"<br>The dateline switch follows Samoa's change from driving on the right to driving on the left in 2009, bringing the country in line with Australia and New Zealand."}