{"Title": "Why Are Song Lyrics So Easy to Memorize?", "Article": "We often remember lyrics to our favorite songs much easily than what is written in our textbooks.  Even if you’re not trying to remember, it seems that your mind sometimes wanders to a song by default. Ira Hyman, a psychologist at Western Washington University in an experiment with Sudoku puzzles found out that students who were given a difficult puzzle complained of having a distracting song “stuck” in their heads. Hyman and his team called them \"intrusive thoughts” which may have some kind of evolutionary purpose, since our brains are built to see patterns in the world and to make associations among our memories and new things we encounter.<br>The other explanations why we   remember lyrics easily are given below:<br>1. Repetition: One of the key reasons that we are so good at remembering music is the same reason we are so good at remembering a number of things that we repeat multiple times.   When we hear a new song and like it, we will then tend to listen to it again and again. Even if you don’t like it, you will probably hear it a good thirty times before you stop playing it. Then subsequently, it will be as though you are hearing the song again every time you remember it. So, the one way you can help yourself is to simply repeat the important facts for your exam over and over and in the precise same order so that it glues to your mind.<br>2. Connections: When we listen a song’s lyrics, we will also remember a tune, a certain voice and probably different instruments. All these things help to provide our brain with more context to help uncover the memories that we were looking for and make those memories longer lasting. You can use this to your advantage when you need to remember something during your exam. Remembering things  such as they were when you tried to memorize the information,  what song you were listening to,  how you felt during it; providing  your brain with contextual clues  can trigger your memory  whenever you want it to,  especially of course when writing  an exam.  <br>3. Rhyme and Pattern: It is commendable how rhythm and rhyme help in remembering things. Since there are no obvious evolutionary reasons for us to remember songs it may seem surprising to think that our brain so readily stores information that rhymes or follows a beat. In fact, it makes perfect sense when you think about it as both the number of beats and the rhymes themselves provide clues as to what the next line is. Structuring and devising information in such a way that remembering the first detail accurately will lead logically to the next detail is the key.  Studies show that simply making things rhyme can aid recalling.<br>A substance called 'NR2B' in the brain which is usually present in abundance during our earlier years, play a major role in memorizing information easily than we can when our brain gets old.  However, it may also be due to the simple fact that we use our brains to learn more frequently when we are young, thus ensuring that it stays better at taking in more information. Also, when we are emotionally moved by something we see or hear, the brain assumes that that information is important and will work harder to store it. In the case of a good song that sends tingles down our spine, our brain is going to assign more significance than to a boring pop song we don't like."}