{"Poem":{"0":"Sourness, I like the taste of it. Even when life gives it to me;<br>raw, strong, head on. They say life gives you lemons, you turn them into lemonade. But me? <br>I say why stop at lemonade? Why not create a lemon tart? Or a sorbet? <br>Why settle for what's the easiest just cuz times are rough? <br>Why not be as strong as that taste? <br>The thing with sourness as a taste, unlike the rest, <br>is that it's presence is maintained even if the things we add to it creates a variety of<br>tongue smacking experience in our mouths; just like the tough times. And you know what? <br>It just adds more flavour, more intensity, more variety, makes the taste complex, <br>stronger, all in all more tastier. That's like going through a rough patch in life,<br>the lemons thrown at us, when we do actually pull through creating something far more <br>complex than possibly simple solution, we create the best, one of a kind taste of our own. <br>Because when we do make something for ourselves, we don't put the focus on the<br>presentation of it, but more into the taste. Not only the taste while eating, <br>the sourness lasts longer than we expect it to. From the aftertaste in our mouth,<br>to turning into acidity if the outcome isn't as positive as we expected, or turning <br>into a good stomach cleanser, just helping while going through. In real life, the <br>sourness lasts forever too. The effects of our actions, how we pulled through in the <br>worst of times, makes a person who they are now. Without few lemons thrown at them,<br>your mom wouldn't be the strong minded one she is today and your dad wouldn't be the<br>decisive action taker he is today. That's the best part of the sourness. More than <br>the sweetness, the sour taste is what moulds the dish for one and it says a lot <br>about how it moulds one's life too...","1":"Turning 18 was a dreadful event<br>No I didn’t want to grow up more than 10 years of age<br>It’s like voluntarily entering a cage <br>That you know will last till your last breath <br>Surprising how you live after it expecting your death at every turn of your life<br>Can’t cut through the tension with a knife cuz it’s all mental now<br>Nothing to shoo the shit away like a scarecrow in the middle of a field<br>Confidence gets harder and harder to yield as the reality hits bad<br>Put up a smile and don’t be sad, at least in front of people<br>Publically just keep it simple no matter how twisted you get inside<br>Where the anxiety and depression resides but no no put up a show<br>Do not let everybody know that you have issues too<br>Actually only a few have the courage to show who they truly are upfront<br>Mistakes made and stories learnt, the experience counts more than ideas<br>Years spent in offices and studios but happiness lost<br>At a great cost that everyone must pay<br>Machines that show emotions and humans made of clay but we have rights<br>To speak against things that hurt and put up a fight for our benefit<br>Truth is nothing good comes out of it even though we try and try<br>Days faking smile and nights to cry in loneliness<br>Too much bitterness in life but need to handle it all on your own<br>Miss all the childhood fun, those careless days and heartwarming nights<br>When adventures mattered, no matter cars trains or flights the journeys mattered<br>More than the destination, sweats lost and teeth clattered, those golden days<br>Has a special place in our hearts which now overlays with pain and ache<br>Perhaps this is what one gets in the track of life that we now spend in this cage<br>I guess this is what it’s meant by “coming of age”","2":"Story begins with no words said, no deeds done,<br>Then how come the blames are blamed and I am the one<br>Feeling the wrath of the family, it’s anarchy,<br>Dealing daily with partiality, oh the patriarchy,<br>Growing up thinking you’re something special,<br>Crush the expectations put up to you like a wall,<br>Just like a warrior, yes I was a fighter in my mind,<br>Only to be reminded that I’m not one of their kind,<br>It needs more than just strength, the man muscles,<br>Wasn’t even given a chance to show the hustle,<br>I was deemed useless, pathetic, a loser in life<br>It wasn’t my choice, someone lost their daughter, someone their wife,<br>It was a show, to let everybody know,<br>that we’re glad, proud even to have someone like you,<br>But behind the locked doors of the house, I was still living in a sewage like a mouse,<br>Seen those tied up luggage on the end of a stick? <br>Seen those faces which feel like they were hit with a brick?<br>All this time thinking the love was for me and I could reach it<br>Only to realise it wasn’t meant to be cuz they were forced to do it<br>I used to be loved, adored, pampered and cared for<br>Who knew I’d be the one taking it granted for some bullshit reason that cannot be solved<br>So bad I wasn’t even thought of in the final decision far from involved,<br>And oh how they ended up looking down on me<br>It's just sad to see people are waiting to be disappointed in me<br>“Oh but tell me what did I do wrong to deserve this pain?” <br>“You don’t belong amongst us, understand? You ruined this white sheet of a thing like a stain.”<br>Constantly hearing things like that broke the confidence I had<br>Yet invisible for everyone to see how torn up I was or sad<br>Broke me down into pieces but fighting against me they were still <br>It's been said to me as if it's some prophecy I'm here to fulfil <br>No I’m done, I’m not here to do this anymore,<br>If you can’t accept me, leave that attitude out the door,<br>If this was right for me I wouldn’t feel so differently than what you claim I should be feeling and that I should be kneeling to every single one of your “advice” but you know what? Kiss my ass goodbye."},"Title":{"0":"Sourness","1":"Coming of Age","2":"Fight Back"},"Writer":{"0":"Anonymous","1":"Anonymous","2":"Anonymous"}}