{"Title": "What Is the Mystery Behind Mehandipur Balaji?", "Article": "<b>The Mystery of Exorcism</b><br>Mehandipur Balaji Temple is a Hindu temple situated in Dausa district of the state of Rajasthan, dedicated to Lord Hanuman (the god of strength). The mighty Hindu God is also famously known as Balaji, hence the name of the temple. Many devotees believe that this place is bestowed with magical powers and hence this pilgrimage site stands witness to thousands of devotees flocking every day to get exorcised find relief from Black Magic. It is believed to provide the best counter-curse to weld off ghosts and evil spirits.<br><br><b>The Legend of Mehandipur Balaji</b><br>The shrine located at the temple has three deities who are mainly worshipped - Lord Hanuman (also known as Balaji), Pret Raj and Bhairav. All these deities are believed to be related to ghosts and spirits. The legend which follows this temple speaks of a divine power and it is believed that the idol which is worshipped here had appeared on its own. The legend also speaks of divine power which circumambience's the temple. It is believed that this power has to ability to cure people who have been affected by evil spirits and helps them to free from the clutches of black magic.<br>If you don't believe in supernatural powers or ghosts, then after visiting Mehandipur Balaji Temple you will. If you love to watch horror movies or enjoy listening to some haunted stories, then this is a must-visit place for you.<br><br><b>The History Behind the Mystery</b><br>One of the most famous temples of India, it has a rich and fascinating history. The three deities of this temple are around 1000 years old. According to the belief, the idol of Lord Hanuman self-appeared amidst the hills of the Aravali and is not created by any artist. Previously, the area of the temple was a dense forest where the ancestors of Shri Mahant Ji started worshipping Balaji. According to the story, the three deities came in a dream of Shri Mahant Ji, and he heard a voice ordering him to be ready for serving his duty. Suddenly, Lord Balaji appeared before him and ordered: \"Take duty of serving me\". After this incident, they started worshipping Lord Hanuman here.<br><br><b>The Formidable Path</b><br>It might seem straight out of a horror movie but many devotees have experienced a change in their surrounding atmosphere the moment they step into this town. Even though the village is located in a warm environment, for a brief moment you would experience a chill down the back of your spine. Another hurdle which you would be experiencing is the impassable crowd throbbing to get a view of the idol. No matter what time of the day you visit this temple, it's always crowded.<br>Many cases of stampede have also been registered and the security is very sloppy thus making it more difficult for the devotees to manoeuvre. However, the shops surrounding the temple are open throughout the day and night with the shopkeepers working in shifts, thus making it easier for the devotees to access the basic necessities if need be.<br><br><b>Screaming Loud</b><br>Unlike a regular temple, this is a place where you will not witness the sound of temple bells. As you step on the premises, you will hear the loud screams of possessed men and women. The sounds might haunt you now and then.<br><br><b>No Offerings to Give</b><br>Mandir or temples are often known for prasads, but Mehendipur Balaji Temple this is a place where no prasad is offered. As you step on the premises of the temple, the petty shopkeepers try to sell prasad. You have to take that black colour ball as it is considered unlucky to refuse them. While it is not meant to be eaten, you have to throw it into the fire. Strange no?<br><br><b>Redeemer of Crisis: Sankat Mochan</b><br>It is believed that Lord Hanuman is the Reliever of all problems. The Black Balls that were offered by the sellers outside the temple are supposed to be taken around your body five times before throwing them in the Ritual Fire. Later, the blessing is sought from the Deity Hanuman who is believed to be the Redeemer of Crisis. It is a spiritually astounding atmosphere in the temple.<br><br><b>A Frightening Atmosphere</b><br>It is undoubtedly a place not for a weak hearted person. You will feel the eeriness of the atmosphere as you step onto the premises. The architecture of the Mehandipur Balaji temple reflects its story and eccentricity; you will surely feel the strong presence of negativity around you. There are four chambers in the temple - the first two chambers have idols of Lord Hanuman and Lord Bhairav, while the last hall might leave you with an eerie experience. You will see that the possessed men and women are banging their heads, pouring boiling water on them without feeling any pain; you find some of them hanging from the ceilings, adults chained to the big rocks and beaten by the pundits. The entire scenario will give goosebumps, and all you want is to leave the place safe and sane.<br><br><b>Never Look Back</b><br>As you set to leave the place, make sure you do not consume anything or don't carry any prasad, water or food item from here. \"Mamma told me, don't be talking to strangers, because strangers are danger\". These lyrics from a popular Bollywood dance number is perfect for this spot, as talking or touching someone is prohibited here as many people are believed to be possessed, and if you touch them you might get affected. Apart from this, once you leave the temple, you should not look back because who knows an evil spirit is watching you and you might give an invitation from them. As soon as you exit the temple premises it is strictly advised to leave the village without having even a drop of water.<br><br><b>Mehandipur Balaji Temple Rituals</b><br>The regular activities performed in this temple include pious rituals and providing food to the needy. There are some specific rituals that must be performed by the visitors, making sure that the right sequence is followed. The rituals can be broadly classified into three parts:<br><br><b>Durkhasta:</b> This ritual requires you to take small Durkhasta laddoos from any shop outside the temple. You will be provided with two plates of these laddoos and all you have to do is offer these plates to the priests standing in front of the Mehandipur Balaji Temple. They will pick as much as they want and add them to the fire burning in front of the deity. Each plate contains 4-5 laddoos. The time of Durkhasta is after the morning prayer and before the evening prayer. The significance of the two plates is that the first plate is to inform God that you are there for his blessings while the second pate is to request him to guide you into achieving your goals and solving your problems. After offering, you must move on and do the same for Pretraj Sarkar and Kotwal Bhairav Ji. After the last offering, you must eat two laddoos out of the leftover ones. The container having more of bhog left in them are encircled by people around their head for 7 times anticlockwise and then thrown away without looking backwards.<br><br><b>Arzi:</b> After Durkhasta, you are required to order for Arzi from any of the shops outside that has a fixed cost of ?270. It includes 1.25 kgs of Laddoos, 2.25 kgs of Urad Dal and 4.25 kgs of Boiled Rice. This is supposed to offer to Pretraj Sarkar and Kotwal Bhairav Ji in two separate containers.<br><br><b>Savamani:</b> Before leaving the temple, if you ask for any wish, you must tell Balaji that once you come back again, you will offer Savamani, a ritual of offering to be done on Tuesdays and Saturdays.<br><br><b>Temple Construction</b><br>As the legend goes, an 11th century Saint Ganesh Puri Ji's ancestor dreamt of Lord Balaji telling him to build a temple for three powers: Ghate Wale Balaji, Pretraj Sarkar and Bhero Nath. The temple was constructed at the place where there used to be a forest in the past. It gradually became a small village and now this temple resides between the two small hills. It is believed that the Balaji idol is self-constructed with stones of a hill, while the remaining temple is constructed according to the idol. The architecture of Mehandipur Balaji Temple is an amazing masterpiece. Its small pillared balconies reflect the tradition of Rajput architecture. The architectural style and beauty of this temple display a blend of uniqueness, eerieness and beauty that attracts tourists all year round.<br><br><b>Do's And Dont's - Mandatory Rules</b><br>•\tDon't touch or talk to strangers inside the temple.<br>•\tStrictly no to food, don't eat or drink anything inside the temple.<br>•\tBefore visiting the temple don't eat meat, onion or non-veg food.<br>•\tDon't carry any prasad or food items while going back to the village.<br>•\tDon't turn back while leaving the temple, who knows someone might wait for you behind.<br>•\tAs you leave the village empty all your food packets and water bottles<br>Visiting this temple comes at a cost. You might have a very disturbing experience after visiting this temple as it is definitely not for the faint-hearted. This place though is a very renowned site for healing people suffering from black magic."}