{"Title": "How Are Memories Formed?", "Article": "Memories contribute so much to our lives as humans. Our ability to learn, tell stories, even to recognize each other’s face and names is all part of memories that we store in our brains, is fascinating. To put it in other words, memory is the ability to encode, store and recall information. Therefore, there are three main processes involved in human memory: Encoding, Storage and Recall (retrieve). Consolidation is also another process in this.<br>1. Memory Encoding: The first step in creating a new memory is encoding. It lets the perceived item to be converted into a construct that can be stored within the brain, and then recalled later from short-term or long-term memory.<br>2. Memory Consolidation: The process of stabilizing a memory trace after the initial acquisition is call Consolidation. This process may happen during the process of Encoding or Storage, or can be considered as a process on its own. It consists of two specific processes: Synaptic Consolidation and System Consolidation.<br>3. Memory Storage:  The process of retaining information in the brain, whether it is in the sensory memory, the short-term memory or long-term memory. Each of  these different stages of human  memory function as a filter that  helps to protect us from flooding  of information that we face on a  daily basis, avoiding an overload  of information and helping to  keep us sane.<br>4. Memory Recall/Retrieval: The subsequent re-accessing of information or events which have been previously encoded and stored in the brain is called Recalling or Retrieving or Remembering.<br><br>Memories are stored as microscopic chemical changes at the connection point between neurons in the brain. Our brain possibly consists of 100 billion neurons, connected to up to 10,000 other neurons. These connecting points are known as ‘synapses’ and they are over 100 trillion in the human brain. The biological process of Encoding begins with perception through the senses. Parts of the brain called the thalamus and the frontal lobe regulates the process of registering a memory with attention. At this time a memorable event causes the neurons to fire frequently, increasing the likelihood of the event to be encoded as memory. Emotion increases attention and the emotional element of an event is processed on an unconscious pathway in the brain leading to the amygdala. Only then are the actual sensations derived from an event processed.<br>The perceived sensations are decoded in the various sensory areas of the cortex, and then combined in the brain’s hippocampus into one single experience. The hippocampus is then responsible for analyzing these inputs and ultimately deciding if they will be committed to long-term memory. It acts as a kind of sorting center where the new sensations are compared and associated with previously recorded ones. The various threads of information are then stored in various different parts of the brain, although the exact way in which these pieces are identified and recalled later remains largely unknown. Completely new neurons grow here.<br>The process of consolidation utilizes a phenomenon called long-term potentiation, which  allows a synapse to increase in  strength as increasing numbers of  signals are transmitted between  the two neurons, which may lead to re-wiring itself by re-routing  connections and re-arranging its  organization.<br>During recall, the brain \"replays\" a pattern of neural activity that was originally generated in response to a particular event, echoing the brain’s perception of the real event. In fact, there is no real solid distinction between the act of remembering and the act of thinking. The replays are not identical to the original but are mixed with an awareness of the current situation. There are two main methods of accessing memory: recognition and recall. Recognition is the association of an event or physical object with one previously experienced or encountered, and involves a process of comparison of information with memory, e.g.  recognizing a known face, true/false or multiple-choice questions, etc. Recognition is a  largely unconscious process, and  the brain even has a dedicated face-recognition area , which  passes information directly through the limbic areas to generate a  sense of familiarity, before linking  up with the cortical path , where  data about the person's  movements and intentions are  processed. Recall involves remembering a fact, event or object that is not currently physically present and requires the direct uncovering of information from memory, e.g. remembering the name of a recognized person, fill-in the blank questions, etc."}