{"Title": "Why Aeroplanes Are Painted White ?", "Article": "When planes come off the factory’s assembly line, they are green, but then they are painted white due to several practical reasons! Have a look!<br>Reason 1- Heat factor!<br>With white paint, the heat is reflected away from the airplane’s exterior, thus reducing the temperature inside the cabin. Due to this, the amount of air conditioning is reduced.<br>Reason 2- Resale!<br>White paint comes in to be handy if the aircraft has to be sold in a hurry. Owners don’t need to repaint the aircraft while selling. Only changing the company name and logo is enough. Moreover, this option is economical too.<br>Reason 3- Lease!<br>Majority of airline companies don’t own any aircrafts. Most of them take it on lease from leasing companies. Hence, the companies from where they hire, don’t allow them to paint. The reason is simple; the resale value of white planes is more than that of painted ones.<br>Reason 4- Visibility factor!<br>When planes are painted white, the ground staff can easily spot the leaking oil, cracks and corrosion. Even in case of airplane crash, white planes can be easily spotted on land as well as water.<br>Reason 5- Colored paint adds more weight !<br>If airplanes are painted in other colors, additional weight is added. If weight is more, even the fuel consumption would be more. If a Boeing 747 is painted in different color, it would add 250 kgs of weight, but if just a white paint job is needed, it would not add more than 25 kgs. By painting the airplanes white, American Airlines saves over $2 million per year on fuel costs.<br>Reason 6- Long lasting in nature!<br>White color doesn’t fade away like other colors do. Moreover, maintaining and cleaning is pretty easy. Usually colored paints fade away owing to exposure to sun, particularly at 30,000 feet where there is more UV radiation.<br>Reason 7 – Saves painting costs!<br>The cost of painting the full body in color falls between $50k-$200k. No airline company would like to spend such a huge amount. Moreover, painting the planes in color consumes 2-3 weeks of time, which in turn causes loss of revenue in that period."}